package com.basic.chapter0100;

/**
 * 简介
 * 读书怎么读：看一个大概，直接用，用的时候回来再查
 * JDK安装后，看下JDK安装目录
 * @author MarkShen1992
 * @since 20191101
 */
public class Chapter0100Introduction {
    public static void main(String[] args) {
        /**
         * SCM系统
         * 电信宽带运营平台
         * 远程教学平台
         * VOD
         * 视频监控
         * 可视电话
         * ERP
         * 视频会议
         * 新闻发布系统
         * 网上商城，电子商务
         * 移动增值平台
         */

        /**
         * 课程内容：
         *      Java基础
         *          语法基础
         *          OO
         *          Exception
         *          Array
         *          基础类
         *          I/O stream
         *          Collection/Generic
         *          Thread
         *          TCP/UDP
         *          GUI
         *          MetaData(EJB3.0)
         *          RegExp
         *          沟通的时候，当你说任何话的时候站在对方角度上考虑下，看他能不能接受
         *          没事的时候，多看看数据结构的内容，算法，设计模式
         *     数据库的知识
         *     html，css, javascript, JSP, Servlet
         *     框架选择，技术选型
         *     Java Web开发框架
         *     Hibernate, Mybatis, JPO(掌握原理，算法+数据结构)
         *     学新东西是件好事儿
         *     EJB3.0的课程，EJB2.0
         *     在招聘网站搜索，招某些职位的量
         *     铺网络，上应用
         * 教学方法：
         *      巨无霸式教学
         *      理论
         *      举例
         *      理论回顾
         *      联系
         *      讲解
         *      注重结合工程实践
         *      注重传授自学能力
         *
         *      时间短，强度大，这个时候要背一些东西的时候还是要背些内容的
         *
         * 能力的三个层次：
         *      1. 知识：（接受能力）
         *          学习前人的东西
         *      2. 解决问题的方法：（碰见什么问题，用什么方法）
         *          灵活运用学到的东西
         *      3. 解决问题的思路：（掌握解决问题的思路，拓展一条思路）
         *          创造解决问题的方法
         *      灵活一点儿，再灵活一点
         *
         * 学习方法；
         *      看算法那本书
         *      完成习题
         *      运用自学的能力
         *          读，写，查，背（*对底子比较薄的同学）
         *
         * 预备知识：
         *      英语
         *      计算机基本操作
         *      正向的暗示
         *      Google + 电驴
         *      软件行业认证：
         *          现在开始别听别人忽悠，别听任何人忽悠，别听我忽悠
         *          用自己的脑子去认识这个世界
         *
         *          国外比较认软件认证：Oracle认证，CCIE(Cisco Certified Internetwork Expert)
         *          考含金量比较高的认证
         *          ERP咨询师
         *          SAP咨询师
         *          共享软件，everything
         *          努力，勤奋
         *          琢磨人，总是要多走一步；走一步看三步，随时留意一些细节
         *          身体：
         *              腰椎，颈椎，手腕
         *
         * 教学资源：
         *
         * 企业与学校之间的区别
         *  时限
         *  使用为主
         *
         * 知识分类：
         *  实际开发过程中经常要用的知识（牢牢掌握）
         *  不经常使用用时就可以查到（了解）
         *  八辈子用不到的知识（运用自己的能里去查）
         *
         *  管理好自己的精力
         *  乐观的努力
         *  眼光要高远一点儿
         *  脚步要踏实
         *
         *  问题（老师）
         *  讲的多，练习时间少
         *  只灌输知识点，没有串联
         *  不培养自学能力
         *  给答案不给思路
         *  项目太简单
         *  项目太复杂
         *  项目太少
         *  注重技巧，不重视基本功
         *  种管理技巧，请开发技巧
         *  知识太旧了
         *
         *  技术 + 行业知识
         *  进销存系统
         *
         *  Java是解释型语言
         *  分层思想
         *
         *  读书怎么读：看一个大概，直接用，用的时候回来再查
         */
        System.out.println("Hello world!");
    }
}
